<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Dawei XU</title>
  <icon>https://www.gravatar.com/avatar/9d39b2a6e3c57a264492b8e97e82756d</icon>
  <subtitle>Flying in the free sky</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://fresky.github.io/"/>
  <updated>2019-12-20T08:29:07.315Z</updated>
  <id>http://fresky.github.io/</id>
  
  <author>
    <name>Dawei XU</name>
    <email>dawei.xu@gmail.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>来自金融时报的可视化辞典</title>
    <link href="http://fresky.github.io/2019/10/25/visual-vocabulary/"/>
    <id>http://fresky.github.io/2019/10/25/visual-vocabulary/</id>
    <published>2019-10-25T10:20:51.000Z</published>
    <updated>2019-12-20T08:29:07.315Z</updated>
    

    <content type="html"><![CDATA[<p><a href="http://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/" target="_blank" rel="noopener">Dumping a C++ object’s memory layout with Clang</a>这篇文章讲述了怎么用Clang来看C++对象的结构，回复中Marek提到了怎么在Visual Studio中看。具体方法如下：</p>  <p>C++项目右键属性，C/C++下的Command Line，加上这个选项</p><br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">/d1reportAllClassLayout</span><br></pre></td></tr></table></figure><br><br><p>这样在编译时就会在output窗口看到所有的对象的内存结构了。</p><p>由于C++编译器会做Name Mangling，我们可以用<strong>undname</strong>这个工具来看到没有被mangling样子。</p><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">&gt;undname</span><br><span class="line">Microsoft (R) C++ Name Undecorator</span><br><span class="line">Copyright (C) Microsoft Corporation. All rights reserved.</span><br><span class="line"></span><br><span class="line">Usage: undname [flags] fname [fname...]</span><br><span class="line">   or: undname [flags] file</span><br></pre></td></tr></table></figure><p>&#160;</p><p>下面是个例子，假设我们有如下的A和B两个类。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">    <span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="keyword">virtual</span> <span class="title">foo</span><span class="params">()</span></span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span>:</span><span class="keyword">public</span> A</span><br><span class="line">&#123;</span><br><span class="line">    <span class="keyword">int</span> b;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="keyword">void</span> <span class="title">foo</span><span class="params">()</span></span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p>它们通过<strong>/d1reportAllClassLayout</strong>的结果如下：</p><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class A    size(8):</span><br><span class="line">1&gt;      +---</span><br><span class="line">1&gt;   0    | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4    | a</span><br><span class="line">1&gt;      +---</span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  A::$vftable@:</span><br><span class="line">1&gt;      | &amp;A_meta</span><br><span class="line">1&gt;      |  0</span><br><span class="line">1&gt;   0    | &amp;A::foo</span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  A::foo this adjustor: 0</span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  class B    size(12):</span><br><span class="line">1&gt;      +---</span><br><span class="line">1&gt;      | +--- (base class A)</span><br><span class="line">1&gt;   0    | | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4    | | a</span><br><span class="line">1&gt;      | +---</span><br><span class="line">1&gt;   8    | b</span><br><span class="line">1&gt;      +---</span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  B::$vftable@:</span><br><span class="line">1&gt;      | &amp;B_meta</span><br><span class="line">1&gt;      |  0</span><br><span class="line">1&gt;   0    | &amp;B::foo</span><br><span class="line">1&gt;  </span><br><span class="line">1&gt;  B::foo this adjustor: 0</span><br></pre></td></tr></table></figure>]]></content>
    
    <summary type="html">
    
      
      
